{
  "suvCars": [
    {
      "id": 1,
      "brand": "Toyota",
      "model": "RAV4",
      "year": 2008,
      "fuelType": "Petrol",
      "transmission": "Automatic",
      "engine": "2.4L Inline-4",
      "price": 1349999,
      "features": ["Sunroof"],
      "details": {
        "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20240213-WA0184.jpg",
        "description": "RAV4s have never disappointed its enthusiasts. With continued production to date, Toyota seems to have produced a car that could last a lifetime with a few equipments like the sunroof that could make life better for its consumers. This is one clean car that is ready to exchange hands with another owner ready to experience what Toyota engineered. It is powered by a large displacement engine of 2400cc which makes the car struggle less when accelerating and gives the engine better longevity. RAV4 turns out to be a perfect low budget maintenance SUV!",
        "location": "Nairobi, Kenya",
        "availability": "Available",
        "drive": "2WD",
        "mileage": "134,000 km",
        "engineSize": "2400 CC",
        "horsePower": 160,
        "torque": "220 Nm",
        "aspiration": "Natural",
        "acceleration": "10 Secs"
      }
    },
    {
      "id": 2,
      "brand": "Audi",
      "model": "Q5 2.0T QUATTRO S-LINE",
      "year": 2015,
      "fuelType": "Petrol",
      "transmission": "Automatic",
      "engine": "2.0L Turbocharged",
      "price": 3299999,
      "features": ["Quattro AWD", "S-Line"],
      "details": {
        "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20240213-WA0153.jpg",
        "description": "The glory of the Q5 lives on. The EA888 2.0L turbocharged petrol engine and the versatility it carries with it is unbeatable. Based on the sedan A5 series, they correlate in a number of factors one being how much these cars are sought after for its performance that is rated at 350Nm of torque for both and equally great fuel economy which averages 13Kms a liter with good driving habits. Quite an excellent car!",
        "location": "",
        "availability": "Available",
        "drive": "AWD",
        "mileage": "127,000 km",
        "engineSize": "2000 CC",
        "horsePower": 222,
        "torque": "350 Nm",
        "aspiration": "Turbo/Supercharger",
        "acceleration": "7 Secs"
      }
    },
    {
      "id": 3,
      "brand": "Lexus",
      "model": "NX200t",
      "year": 2015,
      "fuelType": "Petrol",
      "transmission": "Automatic",
      "engine": "2.0L Turbocharged",
      "price": 5149999,
      "features": ["Sunroof"],
      "details": {
        "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20240212-WA0133.jpg",
        "description": "The NX200t remains to be a king in compact luxury crossover SUVs class sold by Lexus. The sporty nature of the car is complimented by the 2.0L 8AR-FTS turbocharged petrol engine that is one hell of a perfomer. It is also a very economical car attributed to by Lexus' Economy with Superior Thermal Efficient Combustion (ESTEC) direct injection with turbo (D-4ST) fuel injection. It is run by a 6-speed automatic transmission gearbox with a very smooth shift. Definitely a car you can't think twice of acquiring it.",
        "location": "",
        "availability": "Available",
        "drive": "2WD",
        "mileage": "46,000 km",
        "engineSize": "2000 CC",
        "horsePower": 235,
        "torque": "345 Nm",
        "aspiration": "Turbo/Supercharger",
        "acceleration": "6 Secs"
      }
    },
    {
      "id": 4,
      "brand": "Mercedes Benz",
      "model": "GLC 250 4 MATIC",
      "year": 2016,
      "fuelType": "Petrol",
      "transmission": "Automatic",
      "engine": "2.0L Turbocharged",
      "price": 6199999,
      "features": ["Panoramic Sunroof", "Memory Seats", "Burmester Sound System", "360° Camera", "Lane Keep Assist", "Adaptive Cruise Control", "Blindspot Monitoring Assist", "Head-Up Display", "Auto Start Stop"],
      "details": {
        "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20240209-WA0188.jpg",
        "description": "The GLC is the equivalent of the C-Class as most of the design aspects are based off the C-Class. It replaced the GLK-Classe and the first generation came in at 2015 with the 2nd Generation beginning at 2022. It is specced with three-position memory seats that are powered and heated, Burmester premium surround sound system, 360° camera view, lane keep assist, adaptive cruise control, Blindspot Monitoring Assist, a panoramic sunroof, head up display, Auto Start Stop feature, and a flat-bottomed multifunctional steering wheel.",
        "location": "",
        "availability": "Available",
        "drive": "AWD",
        "mileage": "93,000 km",
        "engineSize": "2000 CC",
        "horsePower": 208,
        "torque": "350 Nm",
        "aspiration": "Turbo/Supercharger",
        "acceleration": "6 Secs"
      }
    },
    {
      "id": 5,
      "brand": "Porsche",
      "model": "Macan GTS",
      "year": 2017,
      "fuelType": "Petrol",
      "transmission": "Automatic",
      "engine": "3.0L Turbocharged",
      "price": 8499999,
      "features": ["Bluetooth Integration", "Half Leather Seats", "Dual Zone Climate Controls", "Porsche Communication Management System", "Multifunctional Steering Wheel", "Porsche Active Suspension System", "Dynamic Stability Control", "Cruise Control", "Engine Immobilizer", "Front & Side Impact Curtain Airbags", "Antilock Braking System"],
      "details": {
        "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20240209-WA0234.jpg",
        "description": "Bluetooth integration, half leather seats, dual zone climate controls, Porsche Communication Management System, Multifunctional steering wheel, Porsche Active Suspension system, dynamic stability control, cruise control, engine immobilizer, front & side impact curtain airbags, and Antilock braking system.",
        "location": "",
        "availability": "Available",
        "drive": "AWD",
        "mileage": "49,000 km",
        "engineSize": "3000 CC",
        "horsePower": 360,
        "torque": "500 Nm",
        "aspiration": "Turbo/Supercharger",
        "acceleration": "7 Secs"
      }
    },
    {
      "id": 6,
      "brand": "Peugeot",
      "model": "2008 GT-Line",
      "year": 2017,
      "fuelType": "Petrol",
      "transmission": "Automatic",
      "engine": "1.2L Turbocharged",
      "price": 1999999,
      "features": ["GT-Line", "Modified Roof", "Rolls Royce-inspired design"],
      "details": {
        "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20240208-WA0055.jpg",
        "description": "The 2008 first produced in 2013 with the first generation coded A94, is a luxurious sub-compact crossover SUV, produced by the French automaker, Peugeot. French cars have excelled in producing luxury cars that are very comfortable to drive, making them perfect for long distance drives without all the occupants getting tired of the journey. The roof has been modified to resemble like the one in the Rolls Royce. It has lit lines going through the back and breaking between each other which us an excellent substitute for lacking a moonroof. Being a GT-Line, It gets to the sportier look Peugeot does on its performance cars. It has a Facelifted fascia and a unique red color making it a highly generally attractive car.",
        "location": "",
        "availability": "Available",
        "drive": "2WD",
        "mileage": "86,000 km",
        "engineSize": "1200 CC",
        "horsePower": 134,
        "torque": "270 Nm",
        "aspiration": "Turbo/Supercharger",
        "acceleration": "10 Secs"
      }
    }
  ],
  "featuredCars": [
    {
      "id": 1,
      "model": "Bentley Bentayga 6.0L W12",
      "image": "https://dashboard.kaiandkaro.com/media/vehicles/thumbnails/IMG-20231031-WA0117.jpg",
      "highlight": "Luxury & Power",
      "description": "The Bentayga doesn't shout; you could hear it cutting through the air. The 6.0L W12 engine is super stunning and super powerful. An air suspension system, four-zone climate controls, Traction control, rear-mounted spoiler, and a Mulliner Driving specification that gives a lot of extras to offer.",
      "startingPrice": "KES 33,420,000",
      "caption": "Experience luxury and power with the Bentley Bentayga 6.0L W12. A masterpiece of engineering and design."
    },
    {
      "id": 2,
      "model": "Jeep Grand Cherokee",
      "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/22ed5f47-ca20-4bf4-b116-03f4ccd4c688.jpeg",
      "highlight": "Practicality & Class",
      "description": "The Blackhawk, also called the Laredo, came into the market and took it by storm. It comes equipped with a 3.6-liter engine and various off-road modes. The Jeep Grand Cherokee combines practicality and class, making it a versatile choice for any adventure.",
      "startingPrice": "KES 5,499,999",
      "caption": "Discover the Jeep Grand Cherokee, a perfect blend of practicality and class. Ready for any off-road adventure."
    },
    {
      "id": 3,
      "model": "BMW X4 XDrive 28i",
      "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20240125-WA0166.jpg",
      "highlight": "Limited Edition - BLACKOUT EDITION",
      "description": "In early 2017, BMW introduced a new limited edition called the BLACKOUT EDITION, featuring a range of All-Black X3, X4, and X5s, exclusively for BMW Japan. Only 310 units were produced, and this unit is listed as number 187 of 310. The BMW X4 XDrive 28i features a different fascia, a 2.0L N20B20 inline-4 turbocharged petrol engine, leather seats with memory and heating function, rear armrest, heads-up display, and a sunroof.",
      "startingPrice": "KES 5,499,999",
      "caption": "Experience luxury in the limited edition BMW X4 XDrive 28i BLACKOUT EDITION. Only 310 units were produced, and this is number 187. A unique blend of style and performance."
    },
    {
      "id": 4,
      "model": "Range Rover Sport 3.0 SDV6 HSE",
      "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20231208-WA0021.jpg",
      "highlight": "Luxury & High-Performance",
      "description": "The Range Rover Sport HSE, sitting above SE trim and just below the top-spec 5.0L V8 Supercharged, offers high standard equipment. Features include a standard air suspension system for improved comfort and stability at high speeds and when engaging corners, an All-Wheel Drive system with terrain response management system and multiple offroad modes, and an eight-speed automatic transmission gearbox. The infotainment system is upgraded with a 10-inch Touchscreen for convenient car specs access, and safety features include an automatic emergency braking system, lane-keep assist, and a blind-spot warning system.",
      "startingPrice": "KES 8,999,999",
      "caption": "Discover the Range Rover Sport 3.0 SDV6 HSE, a blend of luxury and high-performance. Equipped with advanced features for a superior driving experience."
    },
    {
      "id": 5,
      "model": "Volkswagen Tiguan 1.4TSI",
      "image": "https://dashboard.kaiandkaro.com/media/vehicles/images/IMG-20240205-WA0112.jpg",
      "highlight": "Efficient & Popular",
      "description": "The Volkswagen Tiguan has been the best-selling SUV in the Volkswagen Group, with over 900,000 units produced in 2019 alone. It is an excellent compact crossover, offering the best efficiency with its 1.4L TSI engine rated at 148hp, consuming close to what a Mazda Demio does.",
      "startingPrice": "KES 2,899,999",
      "caption": "Explore the efficiency and popularity of the Volkswagen Tiguan 1.4TSI. The best-selling SUV with impressive features and performance."
    }
  ]
}

